Study/Computer/Sofeware/OS/kernel/mem_map.dot

digraph G {
nodesep=.05;
rankdir=LR;
node [shape=record,width=.1,height=.1];
nodePhyMemory [label = "<f> PhyMemory
                | <f0> 0xFFFFE000 
                | <f1> ... 
                | <f2> 0x00025000 
                | <f3> 0x00024000 
                | <f4> 0x00023000 
                | <f5> 0x00022000
                | <f6> 0x00021000 
                | <f7> ...
                | <f8> 0x00005000 
                | <f9> 0x00004000
                | <f10> 0x00003000 
                | <f11> 0x00002000
                | <f12> 0x00001000 
                | <f13> 0x00000000
                ",height=2.5];

nodeList1 [label = "<f> PageList1
                    | <f3> ... 
                    | <f2> Page3 
                    | <f1> Page2 
                    | <f0> Page1 
                ",height=2.5];

nodeList2 [label = "<f> PageList2
                    | <f3> ... 
                    | <f2> Page3 
                    | <f1> Page2 
                    | <f0> Page1 
                ",height=2.5];

nodeListN [label = "<f> PageListN
                    | <f3> ... 
                    | <f2> Page3 
                    | <f1> Page2 
                    | <f0> Page1 
                ",height=2.5];

nodeLibrary [label = "<f> PageLibrary
                | <f0> PageTableN 
                | <f1> ... 
                | <f2> PageTable2 
                | <f3> PageTable1 
                ",height=2.5];

nodeLibrary:f3 -> nodeList1:f0;
nodeLibrary:f2 -> nodeList2:f0;
nodeLibrary:f0 -> nodeListN:f0;

nodeList1:f0 -> nodePhyMemory:f13
nodeList1:f1 -> nodePhyMemory:f11

nodeList2:f0 -> nodePhyMemory:f8
nodeList2:f1 -> nodePhyMemory:f7
nodeList2:f2 -> nodePhyMemory:f7

nodeListN:f0 -> nodePhyMemory:f2
nodeListN:f1 -> nodePhyMemory:f5
}
